In [2]:
!pip install seaborn
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn
df_monthly = pd.read_csv('housing_in_london_monthly_variables.csv')
df_yearly = pd.read_csv('housing_in_london_yearly_variables.csv')

Requirement already satisfied: seaborn in /anaconda3/lib/python3.6/site-packages (0.9.0)
Requirement already satisfied: pandas>=0.15.2 in /anaconda3/lib/python3.6/site-packages (from seaborn) (0.25.0)
Requirement already satisfied: scipy>=0.14.0 in /anaconda3/lib/python3.6/site-packages (from seaborn) (1.3.1)
Requirement already satisfied: matplotlib>=1.4.3 in /anaconda3/lib/python3.6/site-packages (from seaborn) (3.1.1)
Requirement already satisfied: numpy>=1.9.3 in /anaconda3/lib/python3.6/site-packages (from seaborn) (1.17.0)
Requirement already satisfied: pytz>=2017.2 in /anaconda3/lib/python3.6/site-packages (from pandas>=0.15.2->seaborn) (2018.7)
Requirement already satisfied: python-dateutil>=2.6.1 in /anaconda3/lib/python3.6/site-packages (from pandas>=0.15.2->seaborn) (2.7.5)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 in /anaconda3/lib/python3.6/site-packages (from matplotlib>=1.4.3->seaborn) (2.3.0)
Requirement already satisfied: cycler>=0.10 in /anaconda3/lib/python3.6/site-packages (from matplotlib>=1.4.3->seaborn) (0.10.0)
Requirement already satisfied: kiwisolver>=1.0.1 in /anaconda3/lib/python3.6/site-packages (from matplotlib>=1.4.3->seaborn) (1.0.1)
Requirement already satisfied: six>=1.5 in /anaconda3/lib/python3.6/site-packages (from python-dateutil>=2.6.1->pandas>=0.15.2->seaborn) (1.15.0)
Requirement already satisfied: setuptools in /anaconda3/lib/python3.6/site-packages (from kiwisolver>=1.0.1->matplotlib>=1.4.3->seaborn) (41.2.0)
WARNING: You are using pip version 20.1.1; however, version 21.3.1 is available.
You should consider upgrading via the '/anaconda3/bin/python -m pip install --upgrade pip' command.

In [46]:
df_monthly.head()

,date,area,average_price,code,houses_sold,no_of_crimes,borough_flag
0,1995-01-01,city of london,91449,E09000001,17.0,NaN,1
1,1995-02-01,city of london,82203,E09000001,7.0,NaN,1
2,1995-03-01,city of london,79121,E09000001,14.0,NaN,1
3,1995-04-01,city of london,77101,E09000001,7.0,NaN,1
4,1995-05-01,city of london,84409,E09000001,10.0,NaN,1

In [47]:
df_yearly.head()

,code,area,date,median_salary,life_satisfaction,mean_salary,recycling_pct,population_size,number_of_jobs,area_size,no_of_houses,borough_flag
0,E09000001,city of london,1999-12-01,33020.0,NaN,48922,0,6581.0,NaN,NaN,NaN,1
1,E09000002,barking and dagenham,1999-12-01,21480.0,NaN,23620,3,162444.0,NaN,NaN,NaN,1
2,E09000003,barnet,1999-12-01,19568.0,NaN,23128,8,313469.0,NaN,NaN,NaN,1
3,E09000004,bexley,1999-12-01,18621.0,NaN,21386,18,217458.0,NaN,NaN,NaN,1
4,E09000005,brent,1999-12-01,18532.0,NaN,20911,6,260317.0,NaN,NaN,NaN,1

In [ ]:
df_19950101 = df_monthly[df_monthly.date=="1995-01-01"]

print("Number of rows in df_19950101 ", len(df_19950101))
print(len(df_19950101.area.unique()))
df_19950101 = df_monthly[df_monthly.code == "E09000001"]
df_19950101
df_monthly.code.unique()
df_monthly.info()
len(df_monthly)
len(df_monthly.columns)
#len(df_monthly['date'].unique())
#len(df_monthly['code'].unique())
#len(df_monthly['average_price'].unqiue())
print(len(df_monthly['average_price'].unique()))
print(len(df_monthly['houses_sold'].unique()))
y_train = df_monthly['average_price']
y_train.shape
len(df_monthly.no_of_crimes.unique())
non_null_crime = df_monthly[df_monthly.no_of_crimes > 0].no_of_crimes
plt.boxplot(non_null_crime)
seaborn.relplot(data=df_monthly, x='date', y='no_of_crimes', hue='area')
plt.show()
df_monthly[ (df_monthly.area == 'england') ].no_of_crimes.unique()
plt.plot(df_monthly.date,df_monthly.houses_sold,)
len(df_monthly['no_of_crimes'].unique())
df_monthly['houses_sold'].plot()
df_monthly['average_price'].plot()
df_monthly['no_of_crimes'].plot()
df_monthly['borough_flag'].plot()
df_monthly['borough_flag'].plot()
df_monthly['borough_flag'].mean()
df_monthly['borough_flag'].std()
df_monthly['no_of_crimes'].plot()

Number of rows in df_19950101  45
45
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13549 entries, 0 to 13548
Data columns (total 7 columns):
date             13549 non-null object
area             13549 non-null object
average_price    13549 non-null int64
code             13549 non-null object
houses_sold      13455 non-null float64
no_of_crimes     7439 non-null float64
borough_flag     13549 non-null int64
dtypes: float64(2), int64(2), object(3)
memory usage: 741.1+ KB
13343
3947